# Terraform plan for production

```
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks: Refreshing state... [id=projects/prd-piny940/secrets/home-kubernetes-cluster-jwks]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=prd-piny940/iamcredentials.googleapis.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=clubroom.piny940.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=terraform-remote-backend.piny940.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=prd-piny940/roles/owner/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=prd-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@prd-piny940.iam.gserviceaccount.com]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Reading...
module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/terraform-github-actions@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:production]
module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/terraform-github-actions]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=prd-piny940/roles/storage.objectUser/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/prd-piny940/serviceAccounts/clubroom@prd-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:clubroom]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=prd-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@prd-piny940.iam.gserviceaccount.com]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Read complete after 0s [id=projects/1056391010239/secrets/home-kubernetes-cluster-jwks/versions/1]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/prd-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.velero.google_project_iam_member.velero_service_account_token_creator will be created
  + resource "google_project_iam_member" "velero_service_account_token_creator" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.velero.google_project_iam_member.velero_storage_object_user will be created
  + resource "google_project_iam_member" "velero_storage_object_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "prd-piny940"
      + role    = "roles/storage.objectUser"
    }

  # module.velero.google_service_account.velero will be created
  + resource "google_service_account" "velero" {
      + account_id                   = "velero"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "Velero"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = "prd-piny940"
      + unique_id                    = (known after apply)
    }

  # module.velero.google_service_account_iam_member.ksa_velero_workload_identity_user will be created
  + resource "google_service_account_iam_member" "ksa_velero_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principal://iam.googleapis.com/projects/1056391010239/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:velero:velero"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.velero.google_storage_bucket.velero will be created
  + resource "google_storage_bucket" "velero" {
      + effective_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "velero-cluster-backup.piny940.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + terraform_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentTerraform Plan for production -->